### Indexing and Selection

| Operation                     | Syntax         | Result    |
|-------------------------------|----------------|-----------|
| Select column                 | df[col]        | Series    |
| Select row by label           | df.loc[label]  | Series    |
| Select row by integer         | df.iloc[loc]   | Series    |
| Select rows                   | df[start:stop] | DataFrame |
| Select rows with boolean mask | df[mask]       | DataFrame |

documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html

## 1.Indexing

##### single level indexing with index5

In [2]:
import pandas as pd
import numpy as np


df = pd.DataFrame(np.random.rand(5,2))
df.index = [ 'row_' + str(i) for i in range(1, 6) ]
df

              0         1
row_1  0.674482  0.526134
row_2  0.491895  0.995894
row_3  0.386900  0.019942
row_4  0.625599  0.415340
row_5  0.329002  0.174740

In [1]:
import pandas as pd
print("Date range", pd.date_range('1/1/2016',periods=36,freq='D'))

Date range DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06', '2016-01-07', '2016-01-08',
               '2016-01-09', '2016-01-10', '2016-01-11', '2016-01-12',
               '2016-01-13', '2016-01-14', '2016-01-15', '2016-01-16',
               '2016-01-17', '2016-01-18', '2016-01-19', '2016-01-20',
               '2016-01-21', '2016-01-22', '2016-01-23', '2016-01-24',
               '2016-01-25', '2016-01-26', '2016-01-27', '2016-01-28',
               '2016-01-29', '2016-01-30', '2016-01-31', '2016-02-01',
               '2016-02-02', '2016-02-03', '2016-02-04', '2016-02-05'],
              dtype='datetime64[ns]', freq='D')

##### now frequency as Business closer BQ

In [2]:
print("Date range", pd.date_range('1/1/2016',periods=4,freq='bq'))

Date range DatetimeIndex(['2016-03-31', '2016-06-30', '2016-09-30', '2016-12-30'], dtype='datetime64[ns]', freq='BQ-DEC')

##### datevalues formatting

In [4]:
pd.to_datetime(['20160101','20160102'],format='%Y%m%d')

DatetimeIndex(['2016-01-01', '2016-01-02'], dtype='datetime64[ns]', freq=None)

In [5]:
pd.to_datetime(['20160101','hello'],format='%Y%m%d',errors='coerce')

DatetimeIndex(['2016-01-01', 'NaT'], dtype='datetime64[ns]', freq=None)

##### converting date frame to dates

In [6]:
d=pd.DataFrame({'Year':[2017,2016],'month':[7,12],'day':[20,22]})
pd.to_datetime(d)

0   2017-07-20
1   2016-12-22
dtype: datetime64[ns]

### 1B Hierarchical Indexing

In [4]:
my_array=[['blue','blue','yellow','yellow','orange','orange'],
         ['true','false','true','false','true','false']]
import numpy as np
myindex=pd.MultiIndex.from_arrays(my_array,names=['name1','name2'])
myindex

MultiIndex(levels=[['blue', 'orange', 'yellow'], ['false', 'true']],
           labels=[[0, 0, 2, 2, 1, 1], [1, 0, 1, 0, 1, 0]],
           names=['name1', 'name2'])

In [6]:
myseries=pd.Series(data=np.random.randn(6),index=myindex)
myseries

name1   name2
blue    true    -0.240500
        false   -2.387453
yellow  true     1.659765
        false    1.407223
orange  true    -0.670422
        false    0.150444
dtype: float64

In [8]:
myseries['blue']

name2
true    -0.240500
false   -2.387453
dtype: float64

In [10]:
myseries['blue','true']

-0.2405003720317388

## 2.Selection

In [1]:
import pandas as pd
import numpy as np

In [2]:
produce_dict = {'veggies': ['potatoes', 'onions', 'peppers', 'carrots'],'fruits': ['apples', 'bananas', 'pineapple', 'berries']}
produce_df = pd.DataFrame(produce_dict)
produce_df

      fruits   veggies
0     apples  potatoes
1    bananas    onions
2  pineapple   peppers
3    berries   carrots

##### selection using dictionary-like string

In [3]:
produce_df['fruits']

0       apples
1      bananas
2    pineapple
3      berries
Name: fruits, dtype: object

##### list of strings as index (note: double square brackets)

In [4]:
produce_df[ ['fruits', 'veggies'] ]

      fruits   veggies
0     apples  potatoes
1    bananas    onions
2  pineapple   peppers
3    berries   carrots

##### select row using integer index

In [5]:
produce_df.iloc[2]

fruits     pineapple
veggies      peppers
Name: 2, dtype: object

##### select rows using integer slice

In [6]:
produce_df.iloc[0:2]

    fruits   veggies
0   apples  potatoes
1  bananas    onions

In [7]:
produce_df.iloc[:-2]

    fruits   veggies
0   apples  potatoes
1  bananas    onions

##### + is over-loaded as concatenation operator

In [8]:
produce_df + produce_df.iloc[0]

            fruits           veggies
0     applesapples  potatoespotatoes
1    bananasapples    onionspotatoes
2  pineappleapples   pepperspotatoes
3    berriesapples   carrotspotatoes

### Data alignment and arithmetic
Data alignment between DataFrame objects automatically align on both the columns and the index (row labels).

Note locations for 'NaN'

In [9]:
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])
sum_df = df + df2
sum_df

          A         B         C   D
0  2.755144 -3.751917 -0.222412 NaN
1  1.431948  1.147275  2.088115 NaN
2  0.550599  0.070135  0.503597 NaN
3 -0.216502 -1.242008 -2.017400 NaN
4 -0.042534 -0.471636  0.925521 NaN
5 -0.531622 -0.682460  0.108012 NaN
6  0.515271 -0.109020  0.114775 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

### Boolean indexing

In [10]:
sum_df>0

       A      B      C      D
0   True  False  False  False
1   True   True   True  False
2   True   True   True  False
3  False  False  False  False
4  False  False   True  False
5  False  False   True  False
6   True  False   True  False
7  False  False  False  False
8  False  False  False  False
9  False  False  False  False

In [11]:
sum_df[sum_df>0]

          A         B         C   D
0  2.755144       NaN       NaN NaN
1  1.431948  1.147275  2.088115 NaN
2  0.550599  0.070135  0.503597 NaN
3       NaN       NaN       NaN NaN
4       NaN       NaN  0.925521 NaN
5       NaN       NaN  0.108012 NaN
6  0.515271       NaN  0.114775 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

 first select rows in column B whose values are less than zero
 
 then, include information for all columns in that row in the resulting data set

In [12]:
mask = sum_df['B'] < 0
mask

0     True
1    False
2    False
3     True
4     True
5     True
6     True
7    False
8    False
9    False
Name: B, dtype: bool

In [14]:
sum_df[mask]

          A         B         C   D
0  2.755144 -3.751917 -0.222412 NaN
3 -0.216502 -1.242008 -2.017400 NaN
4 -0.042534 -0.471636  0.925521 NaN
5 -0.531622 -0.682460  0.108012 NaN
6  0.515271 -0.109020  0.114775 NaN

##### isin function

In [15]:
produce_df.isin(['apples', 'onions'])

  fruits veggies
0   True   False
1  False    True
2  False   False
3  False   False

##### where function

In [16]:
produce_df.where(produce_df > 'k')

      fruits   veggies
0        NaN  potatoes
1        NaN    onions
2  pineapple   peppers
3        NaN       NaN